CSI API ETABS v1
eLoadCaseType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eLoadCaseType
Public Enumeration eLoadCaseType
Dim instance As eLoadCaseType
public enum class eLoadCaseType
type eLoadCaseType
Members
Member name | Value | Description
LinearStatic | 1
NonlinearStatic | 2
Modal | 3
ResponseSpectrum | 4
LinearHistory | 5
NonlinearHistory | 6
LinearDynamic | 7
NonlinearDynamic | 8
MovingLoad | 9
Buckling | 10
SteadyState | 11
PowerSpectralDensity | 12
LinearStaticMultiStep | 13
HyperStatic | 14
See Also
Reference
ETABSv1 Namespace